---
kind: type
id: T:Autodesk.Revit.DB.DataExchangeMessageId
source: html/f8f4737f-8c74-7c67-4669-ddddd2ccde1d.htm
---
# Autodesk.Revit.DB.DataExchangeMessageId

Predefined message ids for DataExchangeLog.

## Syntax (C#)
```csharp
public enum DataExchangeMessageId
```